# MPG Cars

### Introduction:


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a to a variable called cars1 and cars2

In [7]:
cars1 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv")
cars2 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv")
cars1

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
193,24.0,6,200,81,3012,17.6,76,1,ford maverick,NaN,NaN,NaN,NaN,NaN
194,22.5,6,232,90,3085,17.6,76,1,amc hornet,NaN,NaN,NaN,NaN,NaN
195,29.0,4,85,52,2035,22.2,76,1,chevrolet chevette,NaN,NaN,NaN,NaN,NaN
196,24.5,4,98,60,2164,22.1,76,1,chevrolet woody,NaN,NaN,NaN,NaN,NaN
197,29.0,4,90,70,1937,14.2,76,2,vw rabbit,NaN,NaN,NaN,NaN,NaN

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [8]:
cars1 = cars1.loc[:, "mpg":"car"]
cars1

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
193,24.0,6,200,81,3012,17.6,76,1,ford maverick
194,22.5,6,232,90,3085,17.6,76,1,amc hornet
195,29.0,4,85,52,2035,22.2,76,1,chevrolet chevette
196,24.5,4,98,60,2164,22.1,76,1,chevrolet woody
197,29.0,4,90,70,1937,14.2,76,2,vw rabbit

### Step 5. What is the number of observations in each dataset?

In [9]:
print(cars1.shape)
cars2.shape

(198, 9)

(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [14]:
frames= [cars1, cars2]
cars = pd.concat(frames)
cars

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
196,44.0,4,97,52,2130,24.6,82,2,vw pickup
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage
198,28.0,4,120,79,2625,18.6,82,1,ford ranger
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [24]:
import random
owners = np.random.randint(15000,73000,398, dtype="l")
owners

array([32277, 53726, 21298, 59549, 55861, 28276, 26711, 44832, 67880,
       49009, 17385, 35056, 39753, 27743, 18029, 38003, 29269, 20819,
       64854, 18447, 55215, 19255, 72276, 22396, 56819, 46707, 62225,
       65681, 54805, 38648, 22413, 42013, 37930, 65427, 56183, 34475,
       53778, 34386, 44295, 48482, 48116, 41134, 63352, 15570, 49821,
       49183, 46594, 64773, 71322, 53759, 20548, 46274, 72861, 42510,
       52544, 49390, 25693, 69020, 58078, 57717, 48923, 37567, 19048,
       41421, 63536, 51683, 18762, 59392, 31853, 50519, 29222, 36706,
       44852, 23577, 21052, 44352, 17385, 22463, 48113, 28463, 41332,
       52421, 20180, 46576, 47843, 38792, 71461, 15762, 28999, 29606,
       66016, 35938, 49065, 21235, 20170, 42840, 19474, 61059, 64725,
       22197, 59875, 24762, 66964, 15708, 19767, 36054, 39398, 48593,
       48641, 53260, 35847, 33507, 37657, 34326, 70411, 69525, 55290,
       59863, 70222, 49681, 42904, 28294, 34420, 68235, 71249, 35513,
       59603, 37919, 15720, 23320, 36673, 55430, 58076, 17726, 53720,
       67921, 38684, 57917, 15086, 52203, 29294, 55974, 23291, 46283,
       39138, 53216, 50124, 58674, 52377, 31551, 26792, 66120, 45848,
       72840, 72901, 59170, 51529, 34527, 66625, 29459, 58598, 48547,
       60054, 47869, 64850, 34788, 64178, 66757, 28354, 23564, 58206,
       49743, 23759, 36611, 17552, 48357, 39984, 52822, 22084, 51943,
       30809, 68964, 59583, 25110, 51798, 52166, 46555, 35815, 48286,
       55541, 63899, 59105, 40659, 23271, 19467, 16567, 51871, 63746,
       15950, 53160, 21984, 26864, 56962, 38166, 46937, 17864, 31809,
       68754, 41572, 50093, 30617, 29968, 23793, 28204, 27945, 25362,
       67247, 40868, 63302, 67002, 40557, 49743, 40031, 17113, 36145,
       24910, 46272, 34088, 61000, 39015, 68744, 21116, 20466, 23379,
       66834, 28063, 54630, 56827, 42371, 67973, 52162, 54504, 28819,
       33455, 46824, 42298, 40971, 20164, 40373, 39489, 64500, 31871,
       44727, 15347, 59558, 27134, 34082, 37587, 69844, 50893, 34807,
       28345, 64064, 43601, 71394, 47295, 38727, 53729, 27378, 47421,
       60096, 28125, 49537, 41525, 65234, 52228, 38960, 57715, 48575,
       34728, 20160, 41472, 66972, 64154, 61577, 15706, 58424, 36616,
       25053, 31139, 47382, 56576, 42765, 68039, 54120, 50129, 28933,
       31684, 63209, 37233, 55531, 70800, 64902, 40928, 20414, 34052,
       16070, 21869, 56666, 42541, 23439, 46546, 63339, 43442, 21349,
       67399, 17522, 43069, 36944, 50826, 62185, 22678, 25192, 61236,
       62950, 57484, 72506, 68847, 26812, 40972, 15162, 34059, 59467,
       57683, 30310, 16615, 39725, 46258, 62899, 68211, 46526, 36364,
       60815, 57351, 31169, 23818, 59320, 31961, 26967, 44994, 54432,
       23346, 32970, 56593, 28991, 17337, 34632, 69064, 72116, 72577,
       26559, 55689, 39849, 60645, 33393, 47929, 18723, 17208, 23021,
       38867, 55102, 29560, 28232, 41434, 27761, 67115, 43238, 25932,
       33158, 17182, 24032, 33922, 29304, 33813, 53415, 44806, 49326,
       62015, 51475, 50910, 46023, 48841, 48923, 17271, 54174, 33769,
       25510, 49326])

### Step 8. Add the column owners to cars

In [25]:
cars["owners"]= owners

In [26]:
cars

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,32277
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,53726
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,21298
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,59549
4,17.0,8,302,140,3449,10.5,70,1,ford torino,55861
...,...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,17271
196,44.0,4,97,52,2130,24.6,82,2,vw pickup,54174
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage,33769
198,28.0,4,120,79,2625,18.6,82,1,ford ranger,25510
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10,49326